{
    "expand": "html",
    "self": "http:\/\/fw02.zend.com\/issues\/rest\/api\/latest\/issue\/ZF-10578",
    "key": "ZF-10578",
    "fields": {
        "summary": {
            "name": "summary",
            "type": "java.lang.String",
            "value": "Coding Conventions"
        },
        "timetracking": {
            "name": "timetracking",
            "type": "com.atlassian.jira.issue.fields.TimeTrackingSystemField"
        },
        "issuetype": {
            "name": "issuetype",
            "type": "com.atlassian.jira.issue.issuetype.IssueType",
            "value": {
                "self": "http:\/\/fw02.zend.com\/issues\/rest\/api\/latest\/issueType\/4",
                "name": "Improvement",
                "subtask": false
            }
        },
        "votes": {
            "name": "votes",
            "type": "com.atlassian.jira.issue.fields.VotesSystemField",
            "value": {
                "self": "http:\/\/fw02.zend.com\/issues\/rest\/api\/latest\/issue\/ZF-10578\/votes",
                "votes": 0,
                "hasVoted": false
            }
        },
        "security": {
            "name": "security",
            "type": "com.atlassian.jira.issue.security.IssueSecurityLevel"
        },
        "resolution": {
            "name": "resolution",
            "type": "com.atlassian.jira.issue.resolution.Resolution",
            "value": {
                "self": "http:\/\/fw02.zend.com\/issues\/rest\/api\/latest\/resolution\/4",
                "name": "Incomplete"
            }
        },
        "fixVersions": {
            "name": "fixVersions",
            "type": "com.atlassian.jira.project.version.Version",
            "value": [

            ]
        },
        "resolutiondate": {
            "name": "resolutiondate",
            "type": "java.util.Date",
            "value": "2010-10-19T08:42:18.000+0000"
        },
        "reporter": {
            "name": "reporter",
            "type": "com.opensymphony.user.User",
            "value": {
                "self": "http:\/\/fw02.zend.com\/issues\/rest\/api\/latest\/user?username=davidfoley",
                "name": "davidfoley",
                "displayName": "David Foley",
                "active": true
            }
        },
        "created": {
            "name": "created",
            "type": "java.util.Date",
            "value": "2010-10-19T06:51:49.000+0000"
        },
        "updated": {
            "name": "updated",
            "type": "java.util.Date",
            "value": "2010-10-19T11:08:47.000+0000"
        },
        "customfield_10041": {
            "name": "Tags",
            "type": "com.atlassian.jira.plugin.system.customfieldtypes:labels"
        },
        "description": {
            "name": "description",
            "type": "java.lang.String",
            "value": "The current Zend practice of using capital letters in namespaces is counterproductive, as is the tendency to use short canonical names in a platonic style. For example, \r\n\r\n    class Server implements \\Zend\\Server\\Server\r\n\r\nRead just like that, it is not at all obvious as to what Server (of the three) is doing what at all. The above is an extract from Zend 2.0 pre release Zend\/Amf\/Server.php (and this is not me blaming of the developer who implemented the class above, btw)\r\n\r\nWould something like this not be more readable and clear cut\r\n\r\n    class AmfServer implements ZendServer\r\n\r\nWhere ZendServer would be the name of the interface replacing the one defined in the \\Zend\\Server\\Server.\r\n\r\nAnd why \\Zend\\Server\\Server? Surely com\\zend\\server\\ZendServer would be less ambiguous? Reserving PascalCase for class and interface names only is useful for quickly differentiating between namespaces and classes.\r\n\r\nElsewhere in code I see statements like\r\n\r\n    throw new Exception\\RuntimeException\r\n\r\nand\r\n\r\n    Exception\\InvalidArgumentException\r\n\r\nWhat does that mean? Is there any functional benefit whatsoever? I have used PHP for years, and welcomed the 5.3 release which I have been using since beta. I've been looking forward to Zend 2.0 for ages- but the conventions I am seeing here are putting me off.\r\n\r\nMy question is- is it really too late to sit down again and work out more reasonable coding conventions? I see no reason to use the above conventions for any other reason than decorative style. What is the purpose of these conventions? What are you achieving by using them? Is there any practical benefit, or is this just a preference of the Zend community? If it is just preference, why not look beyond it and have a look at the practical benefits of using more normative conventions? \r\n\r\n"
        },
        "priority": {
            "name": "priority",
            "type": "com.atlassian.jira.issue.priority.Priority",
            "value": {
                "self": "http:\/\/fw02.zend.com\/issues\/rest\/api\/latest\/priority\/2",
                "name": "Critical"
            }
        },
        "duedate": {
            "name": "duedate",
            "type": "java.util.Date"
        },
        "customfield_10022": {
            "name": "Fix Version Priority",
            "type": "com.atlassian.jira.plugin.system.customfieldtypes:select"
        },
        "watcher": {
            "name": "watcher",
            "type": "watcher",
            "value": {
                "self": "http:\/\/fw02.zend.com\/issues\/rest\/api\/latest\/issue\/ZF-10578\/watchers",
                "isWatching": false,
                "watchCount": 0
            }
        },
        "worklog": {
            "name": "worklog",
            "type": "worklog",
            "value": [

            ]
        },
        "status": {
            "name": "status",
            "type": "com.atlassian.jira.issue.status.Status",
            "value": {
                "self": "http:\/\/fw02.zend.com\/issues\/rest\/api\/latest\/status\/5",
                "name": "Resolved"
            }
        },
        "labels": {
            "name": "labels",
            "type": "com.atlassian.jira.issue.label.Label",
            "value": [

            ]
        },
        "assignee": {
            "name": "assignee",
            "type": "com.opensymphony.user.User",
            "value": {
                "self": "http:\/\/fw02.zend.com\/issues\/rest\/api\/latest\/user?username=matthew",
                "name": "matthew",
                "displayName": "Matthew Weier O'Phinney",
                "active": true
            }
        },
        "links": {
            "name": "links",
            "type": "issuelinks",
            "value": [

            ]
        },
        "attachment": {
            "name": "attachment",
            "type": "attachment",
            "value": [

            ]
        },
        "sub-tasks": {
            "name": "sub-tasks",
            "type": "issuelinks",
            "value": [

            ]
        },
        "versions": {
            "name": "versions",
            "type": "com.atlassian.jira.project.version.Version",
            "value": [
                {
                    "self": "http:\/\/fw02.zend.com\/issues\/rest\/api\/latest\/version\/10160",
                    "id": 10160,
                    "description": "Major Release",
                    "name": "Next Major Release",
                    "archived": false,
                    "released": false
                }
            ]
        },
        "project": {
            "name": "project",
            "type": "com.atlassian.jira.project.Project",
            "value": {
                "self": "http:\/\/fw02.zend.com\/issues\/rest\/api\/latest\/project\/ZF",
                "key": "ZF",
                "name": "Zend Framework",
                "roles": {

                }
            }
        },
        "components": {
            "name": "components",
            "type": "com.atlassian.jira.bc.project.component.ProjectComponent",
            "value": [

            ]
        },
        "comment": {
            "name": "comment",
            "type": "com.atlassian.jira.issue.fields.CommentSystemField",
            "value": [
                {
                    "self": "http:\/\/fw02.zend.com\/issues\/rest\/api\/latest\/comment\/42571",
                    "author": {
                        "self": "http:\/\/fw02.zend.com\/issues\/rest\/api\/latest\/user?username=matthew",
                        "name": "matthew",
                        "displayName": "Matthew Weier O'Phinney",
                        "active": true
                    },
                    "body": "I don't wish to be combative, but everything you mention here is subjective preference, no more, no less. \r\n\r\n* \"The current Zend practice of using capital letters in namespaces is counterproductive\" -- in what way is it counterproductive? It aids readability when a namespace segment consists of multiple words.\r\n* \"Elsewhere in code I see statements like 'throw new Exception\\RuntimeException' and 'Exception\\InvalidArgumentException'; What does that mean? Is there any functional benefit whatsoever?\" -- Yes, it does: please see the [Exceptions proposal|http:\/\/framework.zend.com\/wiki\/display\/ZFDEV2\/Proposal+for+Exceptions+in+ZF2] for the reasons why. In short, we're using SPL exceptions when available, but don't want to clutter the component namespace with them.\r\n* \"And why \\Zend\\Server\\Server? Surely com\\zend\\server\\ZendServer would be less ambiguous?\" -- Zend Server is a product of Zend Technologies, and would be *more* ambiguous. Zend\\Server is a namespace, \"Server\" the class within the namespace we're using. Of all your arguments, however, this is the one that I can understand -- I don't like the redundancy at all. That said, to ensure that the components are properly encapsulated *within* component namespaces -- a goal we have in order to facilitate packaging and delivery of individual components -- we have yet to come up with any better alternative.\r\n\r\nWhile I understand that *you* don't see the merit behind the decisions, it's also clear you're not following the various proposals and discussions behind the decisions made. If you're interested in shaping future decisions, I urge you to join the zf-contributors mailing list, #zftalk.dev IRC channel on Freenode, and browse through the ZF2 development wiki (http:\/\/framework.zend.com\/wiki\/display\/ZFDEV2\/Home).\r\n",
                    "updateAuthor": {
                        "self": "http:\/\/fw02.zend.com\/issues\/rest\/api\/latest\/user?username=matthew",
                        "name": "matthew",
                        "displayName": "Matthew Weier O'Phinney",
                        "active": true
                    },
                    "created": "2010-10-19T08:41:19.000+0000",
                    "updated": "2010-10-19T08:41:19.000+0000"
                },
                {
                    "self": "http:\/\/fw02.zend.com\/issues\/rest\/api\/latest\/comment\/42575",
                    "author": {
                        "self": "http:\/\/fw02.zend.com\/issues\/rest\/api\/latest\/user?username=davidfoley",
                        "name": "davidfoley",
                        "displayName": "David Foley",
                        "active": true
                    },
                    "body": "Hi Matthew,\r\n\r\nthanks for getting back to me. Yep - its an entirely subjective preference, but its one I don't think I'm alone in having, so its not quite as solipsistic as you put it, in fairness. I don't believe that namespace segments are more readable when entirely PascalCased. I do believe being able to differentiate quickly between classes and namespace segments by the use of some kind of explicit typing convention is more readable. Often I'm more interested in understanding the general purpose of a class as opposed to its hierarchy by reading its class name when scanning source code quickly. So, yes, my personal preference is lowercase namespace segments, and PascalCase class names. But my point is that there should be some kind of casing to differentiate- I don't want to prescribe my preference, I'm simply saying that the current convention elides the distinction.\r\n\r\nThe counter productivity argument is a typo- I meant counter-intuitive. What I meant by that, apart from the superficial adjustment to another style, is that when there are many classes with simple short names, the semantic meaning is ambiguous without namespace prefixes. It feels (yes, subjective) like there is danger for not enough specificity or specialisation going on, which IMHO is a code smell, but in this case, is apparently not- I appreciate your argument concerning components, and I confess that I have to read up on that- but in my experience, reverse domain namespace conventions assist because I can quickly find the author\/vendor- for support or assessment- thats often more important than a knowledge of a component architecture\/hierarchy. That, I would have thought, would be the job of some kind of component descriptor, build process or manifest defined external to the source code. Packaging and delivery of individual concerns should not (ideally IHMO) influence coding conventions or location of files- thats a conflation of concerns is it not?\r\n\r\nIn relation to Exceptions proposal- I will definitely read it, but I would object to using qualified class names in code. The dual purpose of use or import statements is to advise the reader quickly as to what is being used as well has have the runtime resolve dependencies. What is wrong with just declaring them at the top of the file and using them as need be in the code base? That is much less noisy (less text to read) IMHO\r\n\r\nNo worries about being combative- I think this is an important issue- I wrote in frustration and did not qualify any of my points in my first post- but I would like to jump in there and at least try and offer up a critical opinion. I will check out the development wiki, and may well see whats going on in #zftalk.dev, but I'm afraid I've still got concerns. Where can I find out more about the packaging process? I'd like to help out there if I could be any use....\r\n\r\n\r\n",
                    "updateAuthor": {
                        "self": "http:\/\/fw02.zend.com\/issues\/rest\/api\/latest\/user?username=davidfoley",
                        "name": "davidfoley",
                        "displayName": "David Foley",
                        "active": true
                    },
                    "created": "2010-10-19T09:27:50.000+0000",
                    "updated": "2010-10-19T09:27:50.000+0000"
                },
                {
                    "self": "http:\/\/fw02.zend.com\/issues\/rest\/api\/latest\/comment\/42577",
                    "author": {
                        "self": "http:\/\/fw02.zend.com\/issues\/rest\/api\/latest\/user?username=matthew",
                        "name": "matthew",
                        "displayName": "Matthew Weier O'Phinney",
                        "active": true
                    },
                    "body": "Again, just because you believe that the opinion is \"one I don't think I'm alone in having\" does not mean that it's any less subjective. Most decisions made regarding ZF standards are by consensus -- not everyone will agree with them, but a majority agree with them.\r\n\r\nI'm quite familiar with how namespaces are used in Java. We do things a bit differently in PHP, and have evolved different styles. The reverse domain namespace convention certainly can make sense -- but in PHP, we associate a unique namespace per project, which provides equivalent semantics. (i.e., the \"Zend\" namespace refers to \"Zend Framework\", giving you the project and vendor; the \"Symfony\" namespace refers to the Symfony project; etc.) This is a heavily used standard in PHP, and we will not be varying from it.\r\n\r\nRegarding the component descriptor, our goal is to automate generation of these files (package.xml files for use with packaging PEAR packages and distribution via PEAR channels). We prefer not to need to create or maintain these manually, and as such the component organization can aid this process. Additionally, it makes distributing components side-by-side easier, and simpler to understand where the boundaries between components exist on the filesystem.\r\n\r\nRegarding the exceptions, declaring them at the top of the file means they are always loaded... regardless of whether they are ever used. Ideally, exceptions will *not* be encountered in production, which means that declaring them up front is a waste of resources. Lazy loading them is much preferable. (Again, a difference between Java and PHP.)",
                    "updateAuthor": {
                        "self": "http:\/\/fw02.zend.com\/issues\/rest\/api\/latest\/user?username=matthew",
                        "name": "matthew",
                        "displayName": "Matthew Weier O'Phinney",
                        "active": true
                    },
                    "created": "2010-10-19T09:45:52.000+0000",
                    "updated": "2010-10-19T09:45:52.000+0000"
                },
                {
                    "self": "http:\/\/fw02.zend.com\/issues\/rest\/api\/latest\/comment\/42583",
                    "author": {
                        "self": "http:\/\/fw02.zend.com\/issues\/rest\/api\/latest\/user?username=davidfoley",
                        "name": "davidfoley",
                        "displayName": "David Foley",
                        "active": true
                    },
                    "body": "I never suggested a subjective opinion shared makes it more objective- I was simply trying to point out, as an experienced PHP developer, that the PHP world is full of sometimes dubious practices and conventions, and that I was hoping that Zend 2.0 was going to take a different direction than it has, not to say that they are dubious, just unconventional compared to many enterprise standards. If these are the coding standards you guys are using, and they are now set in stone, so be it, I can respect that. However, I can see that the implementation logic is not decoupled from the coding convention in use by the project, and I was just raising concerns, as an outsider looking in. You've given me plenty of information and I'm thankful for that. Thanks for your time.",
                    "updateAuthor": {
                        "self": "http:\/\/fw02.zend.com\/issues\/rest\/api\/latest\/user?username=davidfoley",
                        "name": "davidfoley",
                        "displayName": "David Foley",
                        "active": true
                    },
                    "created": "2010-10-19T11:08:46.000+0000",
                    "updated": "2010-10-19T11:08:46.000+0000"
                }
            ]
        }
    },
    "transitions": "http:\/\/fw02.zend.com\/issues\/rest\/api\/latest\/issue\/ZF-10578\/transitions"
}